cask_args appdir: '/Applications'

tap 'caskroom/cask'
tap 'homebrew/dupes'
tap 'homebrew/php'

# other Homebrew packages
brew 'ansible'
brew 'autocode'
brew 'autoconf'
brew 'automake'
brew 'cmake'
brew 'crystal-lang'
brew 'elixir'
brew 'erlang', args: ['without-docs']
brew 'ffmpeg'
brew 'flac'
brew 'freetype'
brew 'gdbm'
brew 'git'
brew 'go'
brew 'graphicsmagick'
brew 'graphviz'
brew 'homebrew/binary/kwm'
brew 'homebrew/dupes/apple-gcc42'
brew 'homebrew/dupes/zlib'
brew 'homebrew/php/php55'
brew 'homebrew/php/php55-mcrypt'
brew 'imagemagick'
brew 'jpeg'
brew 'lame'
brew 'libevent'
brew 'libiconv'
brew 'libogg'
brew 'libpng'
brew 'libtiff'
brew 'libtool'
brew 'libvorbis'
brew 'libxml2'
brew 'libyaml'
brew 'llvm'
brew 'macvim', args: ['override-system-vim']
brew 'mcrypt'
brew 'mhash'
brew 'mysql', restart_service: true, conflicts_with: ['homebrew/versions/mysql56']
brew 'node'
brew 'npm'
brew 'openssl'
brew 'pkg-config'
brew 'postgresql', restart_service: true
brew 'python'
brew 'qt'
brew 'qtfaststart'
brew 'rancher-compose'
brew 'rbenv'
brew 'readline'
brew 'redis', service_restart: true
brew 'sqlite'
brew 'ssh-copy-id'
brew 'the_silver_searcher'
brew 'tmux'
brew 'vim'
brew 'wget'
brew 'x264'
brew 'xvid'
brew 'zsh'

cask 'adobe-creative-cloud'
cask 'atom'
cask 'docker'
cask 'dropbox'
cask 'firefox'
cask 'flux'
cask 'google-chrome'
cask 'iterm2'
cask 'java' unless system '/usr/libexec/java_home --failfast'
cask 'spotify'

mas '1Password', id: 443987910
mas '3Hub', id: 427515976
mas 'Airmail 2', id: 918858936
mas 'Caffeine', id: 411246225
mas 'Clean', id: 418412301
mas 'Dash', id: 449589707
mas 'Keynote', id: 409183694
mas 'Kindle', id: 405399194
mas 'Mactracker', id: 430255202 
mas 'Numbers', id: 409203825
mas 'Sip', id: 507257563
mas 'Slack', id: 803453959
mas 'Xcode', id: 497799835
mas 'iStat Mini', id: 927292435
